In [71]:
import pandas as pd

In [72]:
df = pd.read_csv("db/2/professor.csv")

In [73]:
df.head()

   codigo            nome               email fone
0       1      Jose Maria   jm@boitata.com.br    -
1       2     Livia Alves                   -    -
2       3  Henrique Sousa                   -    -
3       4     Rita Santos                   -    -
4       5   Romildo Silva  rms@boitata.com.br  NaN

In [53]:
len(df)

12

In [54]:
df.tail()

    codigo              nome             email fone
7        8     Maria Theresa  mt@fisica.ufc.br  NaN
8        9  Alisson Carreira               NaN  NaN
9       10       Joana Silva               NaN  NaN
10      11       Maria Lucia               NaN  NaN
11      12       Maria Joana               NaN  NaN

In [55]:
df.query("codigo =='4'")

Empty DataFrame
Columns: [codigo, nome, email, fone]
Index: []

In [56]:
#number and string
#555.588.900-10
# ? CPF1 + CPF2 
# STRING = VARCHAR(255)
# RG -> 
#PLACA / VV ____ -> VARCHAR = STRING

In [57]:
df.query("codigo == 4 ")

   codigo         nome email fone
3       4  Rita Santos     -    -

In [58]:
df.query('"Maria" <= nome <= "Maria~"')

    codigo           nome             email fone
7        8  Maria Theresa  mt@fisica.ufc.br  NaN
10      11    Maria Lucia               NaN  NaN
11      12    Maria Joana               NaN  NaN

In [59]:
# * - todos
# select * from professor where nome like 'Maria*'
# select * from professor where nome like '*Maria*'

# % - todos
# select * from professor where nome like 'Maria%'
# select * from professor where nome like '%Maria%'

In [60]:
df.query('nome.str.contains("Maria")', engine='python')

    codigo           nome              email fone
0        1     Jose Maria  jm@boitata.com.br    -
7        8  Maria Theresa   mt@fisica.ufc.br  NaN
10      11    Maria Lucia                NaN  NaN
11      12    Maria Joana                NaN  NaN

In [61]:
df.query('nome.str.contains("Maria ")', engine='python')

    codigo           nome             email fone
7        8  Maria Theresa  mt@fisica.ufc.br  NaN
10      11    Maria Lucia               NaN  NaN
11      12    Maria Joana               NaN  NaN

In [62]:
df.query('nome.str.contains(" Maria")', engine='python')

   codigo        nome              email fone
0       1  Jose Maria  jm@boitata.com.br    -

In [63]:
df['nome']

0           Jose Maria
1          Livia Alves
2       Henrique Sousa
3          Rita Santos
4        Romildo Silva
5       Alejando Ayala
6         Gracie Alves
7        Maria Theresa
8     Alisson Carreira
9          Joana Silva
10         Maria Lucia
11         Maria Joana
Name: nome, dtype: object

In [74]:
df.columns

Index(['codigo', ' nome', ' email', 'fone'], dtype='object')

In [75]:
#df.columns = ['codigo', ' nome', 'email', 'fone']

In [76]:
#df.columns

In [67]:
coluna1 = ' nome'

In [68]:
coluna1.strip()

'nome'

In [78]:
novas_colunas =[]
for c in df.columns:
    print(c)
    nc = c.strip()
    novas_colunas.append(nc)

codigo
 nome
 email
fone

In [79]:
novas_colunas

['codigo', 'nome', 'email', 'fone']

In [80]:
df.columns = novas_colunas

In [81]:
df.head()

   codigo            nome               email fone
0       1      Jose Maria   jm@boitata.com.br    -
1       2     Livia Alves                   -    -
2       3  Henrique Sousa                   -    -
3       4     Rita Santos                   -    -
4       5   Romildo Silva  rms@boitata.com.br  NaN

In [82]:
df.columns

Index(['codigo', 'nome', 'email', 'fone'], dtype='object')